{
    "pancake": {
      "name": "Pancake",
      "description": "Fluffy and delicious pancakes.",
      "ingredients": ["Eggs (2pcs)", "Milk (20ml / tsp)", "All purpose flour (30g / 3.3 tbsp)", "Sugar (25g / 2 tbsp)", "Hand Crushed Cardamom Seeds (from 3-4 of them)"],
      "procedure": "Start by separating 2 large eggs into yolks and whites. Mix the yolks with 20 ml (4 teaspoons) of milk until smooth. Sift 30 grams (3.3 tablespoons) of all-purpose or low-gluten flour into the yolk mixture, then mix well. Sift crushed cardamom seeds to the mixture, and stir until the batter is smooth. Next, whip the egg whites with an electric whisk on medium-high speed. Gradually add 25 grams (2 tablespoons) of sugar in three portions: first when large bubbles appear, then when smaller bubbles form, and finally when the texture becomes more visible. Continue beating on medium-low speed until stiff peaks form. Fold one-third of the whipped egg whites into the yolk batter and mix gently. Pour this mixture back into the remaining meringue and combine carefully to maintain the fluffy texture. Transfer the batter into a piping bag. Preheat a non-stick pan over low heat, add a drop of cooking oil, and spread it evenly using kitchen paper. Pipe the batter into the pan, creating three pancakes. Add 2 teaspoons of water to the pan, cover it, and cook on low heat for about 5 minutes. Flip the pancakes carefully, add 1 teaspoon of water, cover, and cook for another 5 minutes. Once done, remove the pancakes from the pan, and serve with butter and syrup for a deliciously fluffy treat.",
      "hardness": 3
    },
    "chocolate-chip-cookie": {
      "name": "Chocolate Chip Cookie",
      "description": "Classic cookies loaded with chocolate chips.",
      "ingredients": ["Unsalted butter (200g/0.875 cup)", "Brown sugar (80g/0.5 cup)", "Granulated sugar (90g/0.5 cup)", "Eggs (2)", "All-purpose flour (200g/1.6 cups)", "Cake flour (120g/1 cup)", "Cornstarch (6g/2 teaspoons)", "Baking powder (4g/1 teaspoon)", "Baking soda (3g/0.5 teaspoon)", "Chopped walnuts (200g/2 cups)", "Chocolate (320g/2 cups)"],
      "procedure": "To make these simple and delicious cookies, begin by creaming together 200 grams (7/8 cup) of unsalted butter, 80 grams (1/2 cup) of brown sugar, and 90 grams (1/2 cup) of granulated sugar in a mixing bowl. Stir the mixture first, then whip it with electric beaters until it becomes slightly whitened. Beat in 2 eggs and whisk the mixture until well combined, using a spatula to clean the sides of the bowl as needed. In a separate bowl, combine the dry ingredients: 200 grams (1.6 cups) of all-purpose or wheat flour, 120 grams (1 cup) of cake flour, 6 grams (2 teaspoons) of cornstarch, 4 grams (1 teaspoon) of baking powder, and 3 grams (1/2 teaspoon) of baking soda. Mix these thoroughly and then gradually add them to the wet ingredients. Stir in 200 grams (2 cups) of chopped walnuts and 320 grams (2 cups) of chocolate, mixing well to ensure even distribution. Take about 160 grams of the dough, knead it, and form it into balls. This recipe makes approximately 8 dough balls. Place the balls into a container, cover them with plastic wrap, and refrigerate for at least 2 hours or overnight for best results. When ready to bake, place the dough balls on a baking sheet and bake in a preheated oven at 180°C (360°F) for 20 minutes. Let the cookies cool before serving. Enjoy!!",
      "hardness": 5
    },
      "cheese-bread":{
        "name": "Cheese Bread",
        "description": "Soft and cheesy bread that melts in your mouth.",
        "ingredients": ["All-purpose flour (200g / 1⅔ cups)", "Cheese (100g / ~1 cup shredded)", "Milk (100ml / ~7 tbsp)", "Butter (50g / 3.5 tbsp)", "Eggs (1pc)", "Salt (1/2 tsp)", "Baking powder (2 tsp)", "Optional herbs or spices (e.g., garlic powder, parsley, to taste)"],
        "procedure": "Begin by cracking three large eggs (about 60g each with shells) into a bowl. Add 50g of oil, 50g of sugar, and 3g of yeast. Mix well with an egg whisk and let the mixture sit for 5 minutes to allow the yeast to dissolve. Whisk again until smooth, then incorporate 300g of flour to form a dough ball with a spatula. Use your hands to press the dough into a smooth ball, ensuring no dry flour remains. Cover it with plastic wrap and let it rest for 20 minutes. Knead the dough until smooth, place it in a bowl, cover it, and let it ferment for about an hour until it doubles in size. Once fermented, place the dough on a mat, press out the air, fold it over a few times, and divide it into 16 equal pieces. Roll each piece into a flat circle, ensuring the center is thicker than the edges. Add mozzarella cheese to the center, pinch tightly to seal, and flatten with your palms. Cover the prepared pieces with plastic wrap to prevent drying. Let them rise for 40 minutes. Heat a pan on low, place the pieces in without oil, cover, and cook for 5 minutes per side, flipping and covering until golden brown. Once cooked, turn off the heat, cover, and let them rest for 3 minutes to retain their fluffiness. Break them open to reveal a soft texture and melted cheese. Enjoy your delicious, cheesy pastries!",
        "hardness": 6
    },
    "cloud-bread":{
      "name": "Cloud Bread",
      "description": "Light and fluffy bread.",
      "ingredients": ["Instant yeast (3g / 1 tsp)", "Milk (200g / 0.8 cups)", "Bread flour or wheat flour (300g / 2 cups)", "Salt (3g / 1/2 tsp)", "Sugar (25g / 2 tbsp)", "Unsalted butter, melted (30g / 2 tbsp)"],
      "procedure": "Start by combining 3 grams (1 teaspoon) of instant yeast with 200 grams (0.8 cups) of milk. Stir well and let the yeast dissolve completely. In a separate bowl, mix 300 grams (2 cups) of bread or wheat flour, 3 grams (1/2 teaspoon) of salt, and 25 grams (2 tablespoons) of sugar. Gradually pour the milk-yeast mixture into the dry ingredients, followed by 30 grams (2 tablespoons) of melted unsalted butter. Stir until the dough begins to come together, then mix until it forms a cohesive dough. Cover the dough and let it rest for 20 minutes. After resting, knead the dough by flipping and smoothing it out, then cover again and let it rise for 1 hour. Once risen, transfer the dough to a lightly floured surface, deflate it, and divide it into three equal portions. Round each portion, cover, and let them rest for another 15 minutes. Take one piece of dough, punch it down, and roll it out. Flip the dough, flatten one edge, and roll it tightly into a cylinder. Repeat for the remaining portions. After shaping, let the dough rest again for 15 minutes. Roll each piece out with a rolling pin, flip, flatten the edges, and roll tightly into cylinders. Place the dough pieces into a toast box (20.8x11.8x11 cm), cover, and let rise for 1 hour or until the dough fills 90% of the box. Cover with a lid and bake at 160°C (320°F) for 25 minutes. Once baked, gently shake the toast box to release hot air and transfer the bread to a cooling rack. Let it cool completely before serving.",
      "hardness": 4
    },
    "cranberry-bread":{
      "name": "Cranberry Bread",
      "description": "Sweet and tangy bread with cranberries.",
      "ingredients": ["Milk (150g / 0.6 cups)", "Yeast (3g / 1 tsp)", "Egg (1pc)", "Sugar (25g / 2 tbsp)", "Bread flour/wheat flour (300g / 2 cups)", "Salt (3g / 1/2 tsp)", "Unsalted butter (30g / 2 tbsp)", "Dried cranberries (50g / 1 cup, chopped)"],
      "procedure": "Combine 150 grams (0.6 cups) of milk, 3 grams (1 teaspoon) of yeast, 1 egg, and 25 grams (2 tablespoons) of sugar in a bowl and mix well. Add 300 grams (2 cups) of bread or wheat flour and 3 grams (1/2 teaspoon) of salt. Mix to form a dough, then knead it with your hands. Cover the dough and let it rest for 20 minutes. After resting, knead the dough once more to smoothen it and incorporate 30 grams (2 tablespoons) of unsalted butter into the dough. Keep kneading until the dough becomes soft and smooth. Roll out the dough into a sheet and sprinkle 50 grams (1 cup) of chopped dried cranberries evenly over it. Knead the cranberries into the dough until well combined. Place the dough in a bowl, cover it, and let it rise for 1 hour. Once risen, roll the dough out into a large sheet using a rolling pin. Cut the sheet into small pieces, knead each piece into a smooth ball, and arrange them on a baking sheet. Cover the dough balls and let them rise for about 40 minutes. After proofing, brush the tops with egg wash and bake in a preheated oven at 180°C (360°F) for 15 minutes. Once baked, allow the bread to cool slightly before serving. These cranberry bread rolls are soft, flavorful, and delicious—perfect to share with your loved ones!",
      "hardness": 6
    },
    "milk-bread":{
      "name": "Milk Bread",
      "description": "Soft and fluffy bread made with milk.",
      "ingredients":["Warm milk (230g)", "Instant yeast (4g)", "Sugar (38g)", "Egg (50g, beaten, after shelling)", "Cooking oil (1 tbsp)", "Bread flour (350g)", "Salt (3g / 1/2 tsp)", "Dry flour (for dusting)"],
      "procedure": "For these fluffy no-knead milk breads, start by mixing 230 grams of warm milk with 4 grams of instant yeast and 38 grams of sugar in a bowl. Add 50 grams of beaten egg (about one egg after shelling) and 1 tablespoon of cooking oil, then stir everything with a spatula until the yeast is fully dissolved in the milk. Next, add 350 grams of bread flour and 3 grams of salt, mixing it well with the spatula until no dry flour remains visible—this should only take about 2 minutes. Cover the bowl with plastic wrap and let the dough rise for about 1 hour, or until it has doubled in size. Once the dough has risen, stir it gently with a spatula to release the air. Sprinkle a thick layer of dry flour onto a mat, then transfer the dough onto it. Sprinkle some flour on top of the dough to prevent sticking, and fold it a few times to shape it into a round. Divide the dough into 9 equal parts, shaping each piece into a round by folding and tucking it underneath itself. Let the dough balls rest for 15 minutes, covered with plastic wrap. If you want smoother rolls, you can reshape them by sprinkling some dry flour, pressing out any air, flipping, and rounding them again. Arrange the dough balls in a 23x23 cm oven dish, cover with plastic wrap, and let them rise for another hour. Preheat your oven to 175°C (350°F) and once the dough is ready, sprinkle a thin layer of flour on top of each roll. Bake them in the oven for 22 minutes, covering with aluminum foil for the last 8 minutes to avoid browning too much. After baking, take them out of the oven, and you’ll have perfectly soft, fluffy breads. Have Fun!",
      "hardness": 3
    }
  }
  